{
	"landing": {
		"firstName": "Shubham",
		"lastName": "Kaudewar",
		"phoneNumber": "+91-8657528799",
		"companyUrl": "",
		"companyName": "",
		"bio_1": "",
		"bio_2": "Hi, I graduated in Chemical Engineering from IIT Bombay in 2021. I am a coding enthusiast and have evolved into a full-stack developer. I was nominated as the Web Manager of NSS IIT Bombay, the largest social volunteer body at IIT Bombay, where I applied my expertise to build dynamic websites and pages. Previously, I worked as a Software/Platform Engineer at WealthDesk Technologies Pvt. Ltd.",
		"bioHead": "Technical Proficiencies:",
		"bio2": "My tech stack includes Python and Javascript. I have predominantly used Python for server-side scripting mainly in the Django framework, while Javascript for frontend in the React environment. I am also highly capable of working with databases like MySQL, SQLite, JSON, and MongoDB.",
    "email": " | kaudewar@gmail.com",
    "coderrank": "https://profile.codersrank.io/user/shubhamkaudewar/",
    "linkedin": "https://www.linkedin.com/in/shubham-kaudewar-736ab6137/",
	"github": "https://github.com/ShubhamKaudewar",
	"hackerRank": "https://www.hackerrank.com/ShubhamKaudewar",
	"sololearn": "https://www.sololearn.com/Profile/374584"
	},
	"experience": [
		{
			"position": " Software Engineer",
			"organization": "Sandhya Realtech LLP (Stealth mode Pvt Firm)",
			"aboutWork": [
				"Optimized Equity CTCL service that leverage NSE's NNF infrastructure for real-time communication with the NSE’s Co-Location facility for trade purpose using socket communication",
				"Optimized listener and reader threads to process and capture buffer bytes from NSE's Co-Location server",
				"Analyzed network packets using Wireshark to verify handshake processes and evaluate packet sizes"
			],
			"fromDate": "August 2024",
			"toDate": "October 2024"
		},
		{
			"position": "Platform Engineer",
			"organization": "Wealthdesk Technologies Pvt Ltd",
			"aboutWork": [
				"Built Broker Gateway aka EWG an end-to-end single window transaction flow for 10K+ active users using AWS, Python, APIs, DB. Project also caters to after market hours 2K+ users orders scheduled for the next market day",
				"Implemented eNACH auto-debit system for recurring payments including SIP in wealthbasket and recurring fees",
				"Developed various microservices for business solutions such as Analytics Dashboards, Notification & OTP Service",
				"Day-to-Day responsibility included communication with over 15+ big brokers' tech teams for APIs integration, API docs reading, DB query, deployments in various development envs, QA Testing and CI/CD Pipelines"
			],
			"fromDate": "June 2021",
			"toDate": "August 2022"
		},
		{
			"position": "Node Developer",
			"organization": "AFO Technologies Pvt Ltd",
			"aboutWork": [
				"Strava User Health Data fetch testing with Postman and storing data from APIs to Firebase with Node.js",
				"OAuth setup worked with Access Tokens, Refresh Tokens, and Deployment of Firebase Emulator",
				"Bubble.io web app Google login authentication setup and learned Web-App workflows"
			],
			"fromDate": "Jan 2021",
			"toDate": "Apr 2021"
		},
		{
			"position": "Full-Stack Developer",
			"organization": "Porsio Marketplace PVT LTD",
			"aboutWork": [
				"Built e-commerce site for future on-demand services targeting approximately 120M market users along with 1.2M Porsio Users",
				"Represented CMS blueprint from associated database flow aimed to optimize delivery speed with organized data flow",
				"Submitted weekly module work within deadline, with modules graded at an average of 4/5 stars rating by month's end",
				"Integrated third-party payment gateway service Razorpay, SMS service Twilio, and Django inbuilt-core mailing service",
				"Delivered data from the frontend to backend with AJAX GET, POST HTTP request method format in an efficient way"
			],
			"fromDate": "June 2020",
			"toDate": "June 2020"
		},
		{
			"position": "Web & Design Head",
			"organization": "NSS IIT-Bombay",
			"aboutWork": [
				"Honored by NSS organizational award for extraordinary performance among core team of 11 members",
				"Managed a team of 3 members who maintained 25+ webpages using latest tech, homepage reaching 0.17M web impressions",
				"Repaired OLI Video Downloader with 200+ downloadable videos, reaching 8K yearly users and averaging 0.16M site visitors",
				"Contributed to OLI NSS YouTube Channel, receiving Silver Play Button with 117K+ subscribers and 10M+ views",
				"Built Birds of IIT-Bombay PHP site, detailing 95+ bird species, optimized live search filter, 1K+ user visits",
				"Developed Flare - PAN India online competition site, reaching 2.5K unique visitors with 5K+ total visits and average session duration of 2m 28s"
			],
			"fromDate": "April 2019",
			"toDate": "April 2020"
		},
		{
			"position": "Activity Associate",
			"organization": "NSS IIT-Bombay",
			"aboutWork": [
				"Part of a team of 3 AAs responsible for development and regular maintenance of NSS site over a year",
				"Built and ideated static sites using HTML, CSS, JS for different viewports with PHP for server-side scripting",
				"Implemented SEO techniques using meta tags, alternative tags, image and file size compression to improve webpage rankings and increase site user traffic",
				"Developed NOCS portal to address queries from freshmen registering for NSS courses",
				"Developed Open Learning Initiative site with academic curriculum for classes 6-10, offering 200+ animated videos available in 8+ languages, reaching 100K+ site visitors",
				"Organized events to publicize NSS core departmental initiatives and raise awareness among freshmen students"
			],
			"fromDate": "April 2018",
			"toDate": "April 2019"
		},
		{
			"position": "SME Intern",
			"organization": "TutorMate Edu.",
			"aboutWork": [
				"Assisted in content creation and curriculum development in line with company protocols",
				"Subject Matter Expert in physics for content development of NCERT, MHCET, IITJEE, NEET, with proficiency in Microsoft Word and MathType",
				"Part of a team, consistently completing daily tasks within deadlines over the month"
			],
			"fromDate": "December 2019",
			"toDate": "January 2020"
		},
		{
			"position": "Hospitality & PR Coordinator",
			"organization": "Mood Indigo",
			"aboutWork": [
				"Positioned as College Ambassador at various colleges for publicity, conducted 10+ school and college-level activities with prizes showcasing Mood Indigo festival",
				"Conducted college publicity drive in major Mumbai colleges, increasing fest footfall participants by 10%",
				"Managed Hostel-3, ensuring security and handling logistics for the accommodation of 200+ participants",
				"Negotiated deals with portable cabin vendors, prioritizing quality services for fest visitors' best experience",
				"Increased fest participation by 5% by arranging affordable accommodation within 5KM radius for dormitories",
				"Managed Cloak Room security for bags and essentials during concerts over 4 consecutive days"
			],
			"fromDate": "December 2018",
			"toDate": "January 2019"
		}
	],
	"education": [{
			"university": "Indian Institute of Technology, Bombay",
			"degree": "Bachelor of Technology",
			"branch": "Chemical Engineering",
			"year": "Graduate",
			"fromDate": "July 2017",
			"toDate": "August 2021"
		}
	],
	"skills": [
		{
			"name": "AWS",
			"link": "https://aws.amazon.com/"
		},
		{
			"name": "Apache Velocity",
			"link": "https://velocity.apache.org/"
		},
		{
			"name": "Python",
			"link": "https://www.python.org/"
		},
		{
			"name": "Django",
			"link": "https://www.djangoproject.com/"
		},
		{
			"name": "Heroku",
			"link": "https://www.heroku.com/"
		},
		{
			"name": "Docker",
			"link": "https://www.docker.com/"
		},
		{
			"name": "PHP",
			"link": "https://www.php.net/"
		},
		{
			"name": "JavaScript",
			"link": "https://www.javascript.com/"
		},
		{
			"name": "ReactJs",
			"link": "https://reactjs.org/"
		},
		{
			"name": "NodeJs",
			"link": "https://nodejs.org/en/"
		},
		{
			"name": "HTML5",
			"link": "https://html.com/"
		},
		{
			"name": "CSS3",
			"link": "https://www.w3.org/Style/CSS/Overview.en.html"
		},
		{
			"name": "VS Code",
			"link": "https://code.visualstudio.com/"
		},
		{
			"name": "MySQL",
			"link": "https://www.mysql.com/"
		},
		{
			"name": "SQLite",
			"link": "https://www.sqlite.org/"
		},
		{
			"name": "MongoDB",
			"link": "https://www.mongodb.com/"
		},
		{
			"name": "phpMyAdmin",
			"link": "https://www.phpmyadmin.net/"
		},
		{
			"name": "Git & GitHub",
			"link": "https://github.com/"
		},
		{
			"name": "SSH Terminal",
			"link": "https://www.ssh.com/ssh/"
		},
		{
			"name": "Google Analytics",
			"link": "https://analytics.google.com/"
		},
		{
			"name": "Google Cloud APIs",
			"link": "https://cloud.google.com/apis/docs/overview"
		},
		{
			"name": "C++",
			"link": "http://www.cplusplus.org/"
		},
		{
			"name": "jQuery",
			"link": "https://jquery.com/"
		},
		{
			"name": "Ajax",
			"link": "https://developer.mozilla.org/en-US/docs/Web/Guide/AJAX"
		}
	],
	"interests": {
		"paragraphOne": "Apart from being a web developer, I enjoy most of my time watching TV Series and listening to music. In the institute, I spent the most time with friends. I like to explore new food places in Mumbai. I like to read tech articles and posts a lot. Character L in death note is my favorite",
		"paragraphTwo": "When forced indoors, I follow many sci-fi and fantasy genre movies and television shows, I am an aspiring chef, and I spend a large amount of my free time exploring the latest technology advancements in the front-end web development world."
	},
	"awards": [{
			"awardDetail": "5 Gold and 1 silver badges along with 3 Verified Skills Certification on HackerRank"
		},
		{
			"awardDetail": "Certified in 5 programming courses on Sololearn"
		},
		{
			"awardDetail": "Achieved 100% in SEO Chrome Light House Audit"
		},
		{
			"awardDetail": "Typing speed 85 WPM in top 4% of world"
		},
		{
			"awardDetail": "Amongst the top 99 percentile in JEE-Advanced 2017"
		},
		{
			"awardDetail": "First Rank in District in MTSE Exam in 2013"
		}
	]
}
